PinkFluffyUnic0rn/stm32flight/runvals.h
/**
* @file runvals.h
* @brief Global values that can be changed during run and dsp contexts
*/

#ifndef RUNVALUES_H
#define RUNVALUES_H

#include "settings.h"
#include "dsp.h"
#include "log.h"
#include "crc.h"
#include "runvals.h"
#include "timev.h"
#include "command.h"
#include "util.h"

#include "icm42688.h"
#include "qmc5883l.h"
#include "lis3mdl.h"
#include "mmc5983ma.h"
#include "dps368.h"
#include "crsf.h"
#include "msp.h"

/**
* @defgroup TIMEREVENTIDS
* @brief Timer events IDs
*/
enum TEV_ID { 
	TEV_IMU		= 0,	/*!< log update event ID */
	TEV_LOG		= 1,	/*!< log update event ID */
	TEV_PID		= 2,	/*!< PID event ID */
	TEV_CHECK	= 3,	/*!< connection check event ID */
	TEV_BARO	= 4,	/*!< barometer update event ID */
	TEV_MAG		= 5,	/*!< magnetometer update event ID */
	TEV_TELE	= 6,	/*!< telemetry send event ID */
	TEV_POWER	= 7,	/*!< battery power update event ID */
	TEV_AUTOPILOT	= 8,	/*!< autopilot event ID */
	TEV_COUNT	= 9	/*!< timer events count */
};

/**
* @defgroup LPFIDS
* @brief low-pass filters IDs
*/
enum LPF_ID {
	LPF_BAT		= 0,	/*!< battery voltage low-pass filter */
	LPF_CUR		= 1,	/*!< battery voltage low-pass filter */
	LPF_AVGTHR	= 2,	/*!< average motors thrust filter */
	LPF_AVGTHRA	= 3,	/*!< average motors thrust filter
					for altitude correction*/
	LPF_VAU		= 4,	/*!< vertical acceleration unity filter */
	LPF_THR		= 5,	/*!< trust acceleration low-pass filter */
	LPF_VAPT1	= 6,	/*!< vertical acceleration low-pass filter */
	LPF_VAAVG	= 7,	/*!< vertical acceleration averaging filter */
	LPF_FA		= 8,	/*!< forward acceleration low-pass filter */
	LPF_SA		= 9,	/*!< sideward acceleration low-pass filter */
	LPF_ALT		= 10,	/*!< altitude low-pass filter */
	LPF_BARTEMP	= 11,	/*!< temperature low-pass filter */
	LPF_IMUTEMP	= 12,	/*!< IMU temperature unity filter */
	LPF_ACCX	= 13,	/*!< accelerometer x low-pass filter */
	LPF_ACCY	= 14,	/*!< accelerometer y low-pass filter */
	LPF_ACCZ	= 15,	/*!< accelerometer z low-pass filter */
	LPF_GYROX	= 16,	/*!< gyroscope x low-pass filter */
	LPF_GYROY	= 17,	/*!< gyroscope y low-pass filter */
	LPF_GYROZ	= 18,	/*!< gyroscope z low-pass filter */
	LPF_MAGX	= 19,	/*!< gyroscope x low-pass filter */
	LPF_MAGY	= 20,	/*!< gyroscope y low-pass filter */
	LPF_MAGZ	= 21,	/*!< gyroscope z low-pass filter */
	LPF_ROLL	= 22,	/*!< roll unity filter */
	LPF_PITCH	= 23,	/*!< pitch unity filter */
	LPF_YAW		= 24,	/*!< yaw unity filter */
	LPF_SPEED	= 25,	/*!< speed unity filter */
	LPF_LATM	= 26,	/*!< latitude in meters unity filter */
	LPF_LONM	= 27,	/*!< longitude in meters unity filter */
	LPF_COUNT	= 28	/*!< low-pass filters count */
};

/**
* @defgroup CMPLIDS
* @brief Complimentary filters IDs
*/
enum CMPL_ID {
	CMPL_PITCH 	= 0,	/*!< pitch compimentary filter */
	CMPL_ROLL 	= 1,	/*!< roll compimentary filter */
	CMPL_YAW	= 2,	/*!< yaw compimentary filter */
	CMPL_CLIMBRATE	= 3,	/*!< climb rate complimentary filter */
	CMPL_ALT 	= 4,	/*!< altitude complimentary filter */
	CMPL_SLAT	= 5,	/*!< moving through latitiude speed
					complimentary filter */
	CMPL_SLON	= 6,	/*!< moving through longitude speed
					complimentary filter */
	CMPL_LAT	= 7,	/*!< latitude complimentary filter */
	CMPL_LON	= 8,	/*!< longitude complimentary filter */
	CMPL_COUNT 	= 9	/*!< complimentary filters count */
};

/**
* @defgroup PIDIDS
* @brief PID controllers IDs
*/
enum PID_ID {
	PID_PITCHP	= 0,	/*!< pitch PID context */
	PID_ROLLP	= 1,	/*!< roll PID context */
	PID_YAWP	= 2,	/*!< pitch speed PID context */
	PID_PITCHS	= 3,	/*!< roll speed PID context */
	PID_ROLLS	= 4,	/*!< yaw PID context */
	PID_YAWS	= 5,	/*!< yaw speed PID context */
	PID_VA		= 6,	/*!< vertical acceleration PID context */
	PID_CLIMBRATE	= 7,	/*!< climb rate PID context */
	PID_ALT		= 8,	/*!< altitude PID context */
	PID_SLAT	= 9,	/*!< speed through latitiude PID context */
	PID_SLON	= 10,	/*!< speed through longitude PID context */
	PID_LAT		= 11,	/*!< latitude PID context */
	PID_LON		= 12,	/*!< longitude PID context */
	PID_COUNT	= 13	/*!< pid controllers count */
};

/**
* @brief Altitude control mode.
*/
enum ALTMODE {
	ALTMODE_ACCEL	= 0,	/*!< acceleration stabilization */
	ALTMODE_SPEED	= 1,	/*!< climb rate stabilization */
	ALTMODE_POS	= 2	/*!< altitude stabilization */
};

/**
* @brief GNSS control mode.
*/
enum GNSSMODE {
	GNSSMODE_NONE	= 0,	/*!< no GNSS stabilization */
	GNSSMODE_SPEED	= 1,	/*!< speed stabilization */
	GNSSMODE_POS	= 2	/*!< position stabilization */
};

/**
* @brief GNSS data status.
*/
enum GNSSSTATUS {
	GNSSSTATUS_VALID	= 0,	/*!< data is valid */
	GNSSSTATUS_INVALID	= 1	/*!< data is invalid */
};

/**
* @brief Latitude direction.
*/
enum LATDIR {
	LATDIR_N	= 0,	/*!< north */
	LATDIR_S	= 1,	/*!< south */
};

/**
* @brief Longitude direction.
*/
enum LONDIR {
	LONDIR_E	= 0,	/*!< east */
	LONDIR_W	= 1	/*!< west */
};

/**
* @brief Magnetic declination direction.
*/
enum MAGVARDIR {
	MAGVARDIR_E	= 0,	/*!< east */
	MAGVARDIR_W	= 1	/*!< west */
};

/**
* @brief Configuration value type.
*/
enum CONFVALTYPE {
	CONFVALTYPE_INT		= 0,	/*!< integer */
	CONFVALTYPE_FLOAT	= 1,	/*!< float */
	CONFVALTYPE_STRING	= 2	/*!< string */
};

/**
* @brief Autopilot track point type
*/
enum AUTOPILOT_TYPE {
	AUTOPILOT_START 	= 0,	/*!< starting point */
	AUTOPILOT_TAKEOFF	= 1,	/*!< perform takeoff */
	AUTOPILOT_HOVER		= 2,	/*!< hover */
	AUTOPILOT_FORWARD	= 3,	/*!< move to pointed location */
	AUTOPILOT_LANDING	= 4,	/*!< perform landing */
	AUTOPILOT_STOP		= 5	/*!< stop point */
};

/**
* @brief Values got from GNSS module using NMEA protocol
*/
struct gnss_data {
	enum GNSSSTATUS status;		/*!< GNSS data status 1 if
						valid, 0 otherwise */

	double time;			/*!< seconds passed from
						00:00 UTC */
	char date[10];			/*!< date in format dd.mm.yy */

	uint8_t lat;			/*!< latitude */
	double latmin;			/*!< latitude minutes */
	enum LATDIR latdir;		/*!< latitude direction, 1 if
						south, 0 if north */
	double declat;			/*!< latitude in decimal
						degress format */

	uint8_t lon;			/*!< longitude */
	double lonmin;			/*!< longitude minutes */
	enum LONDIR londir;		/*!< longitude direction, 1 if */
					/*!< west, 0 if east */
	double declon;			/*!< longitude in decimal
						degress format */


	double magvar;			/*!< magnetic declination in
						degrees */
	enum MAGVARDIR  magvardir;	/*!< magnetic declination
						direction, 0 if east,
						1 if west */

	double speed;			/*!< speed in knots */
	double course;			/*!< course toward north pole
						in degrees */
	double altitude;			/*!< altitude in meters */

	int quality;			/*!< link quality */
	uint8_t satellites;		/*!< satellites count */
};

/**
* @brief Autopilot track point
*/
struct trackpoint {
	union {
		struct {
			double alt;	/*!< target altitude */
			double t;	/*!< time to take off */
		} takeoff;		/*!< take off point description */
		struct {
			double x, y;	/*!< coordinates to look at */
			double alt;	/*!< target altitude */
			double t;	/*!< hovering time */
		} hover;		/*!< hover point description */
		struct {
			double x, y;	/*!< coordinates to move to */
		} forward;		/*!< move point description */
	};

	enum AUTOPILOT_TYPE type; /*!< point type */
};

extern int Init;

/**
* @brief Timer events
*/
extern struct timev Evs[TEV_COUNT];

/**
* @brief Low-pass filters
*/
extern struct dsp_lpf Lpf[LPF_COUNT];

/**
* @brief Complimentary filters
*/
extern struct dsp_compl Cmpl[CMPL_COUNT];

/**
* @brief PID controllers
*/
extern struct dsp_pidblval Pid[PID_COUNT];

/**
* @brief Timer events names
*/
extern const char *Evnames[TEV_COUNT];

/**
* @defgroup GLOBALSTORAGE
* @brief Global storage for sensor
	data that aquired in separate events
* @{
*/
extern struct mag_data Magdata;		/*!< magnetometer data */
extern struct imu_data Imudata;		/*!< IMU data */
extern struct baro_data Barodata;	/*!< Barometer data */
extern struct gnss_data Gnss;		/*!< GNSS data */
extern struct crsf_tele Tele;		/*!< telemetry values */
extern struct msp_osd Osd;		/*!< OSD values */
/**
* @}
*/

/**
* @defgroup CONTROLVALUES
* @brief Control values
* @{
*/
extern double Thrust; /*!< motors basic thrust */
extern double Rolltarget; /*!< roll PID target */
extern double Pitchtarget; /*!< pitch PID target */
extern double Yawtarget; /*!< yaw PID target */
extern double En; /*!< 1.0 when motors turned on, 0.0 otherwise */
extern enum ALTMODE Altmode; /*!< ALTMODE_POS if in altitude hold mode,
				ALTMODE_SPEED if climbrate control mode,
				ALTMODE_ACCEL if acceleration control mode */

extern enum GNSSMODE Gnssmode; /*!< GNSSMODE_NONE GNSS hold not used,
				GNSSMODE_SPEED if speed control mode,
				GNSSMODE_POS if position control mode */
extern int Speedpid;	/*!<  1 if only gyroscope if used for yaw
			stabilization, 0 if accelerometer is used */
extern int Yawspeedpid;	/*!< 1 if only gyroscope if used for yaw
			stabilization, 0 if magnetometer is used */
extern int Hovermode; 	/*!< hover mode, when throttle is
			controlled relative to hover throttle */
extern int Autopilot;	/*!< autopilot mode, 1 when autopilot
			is enabled, 0 otherwise */
extern int Elrs; /*!< 1 when ELRS control is active (ELRS remote's
			channel 8 is > 50) */
/**
* @}
*/

extern double Alt0;	/*!< reference altitude */
extern double Lat0;	/*!< reference latitude */
extern double Lon0;	/*!< reference longitude */
extern double Goffset;	/*!< free fall acceleration (g) value offset */

/**
* @brief Autopilot track points
*/
extern struct trackpoint Points[MAX_POINT_COUNT];
extern int Pointscount;		/*!< autopilot track points count */
extern int Curpoint;		/*!< current autopilot track point */
extern double Autopilottimer;	/*!< autopilot timer */

extern int Curslot; /*!< current settings slot */

extern int Loops; /*!< stabilization loops counter */

extern int Loopscount; /*!< stabilization loops performed in last second */

/**
* @brief Timeout counter for the ELRS reciver. Set to
	ELRS_TIMEOUT after receiving useful packet from receiver
	and decreased by 1 every second. If it falls to 0,
	quadcopter disarms.
*/
extern int Elrstimeout;

/**
* @brief Emergency disarm triggered, further
	arming is possible only after reboot
*/
extern int Emergencydisarm;

/**
* @brief Set motors thrust. All values should be between 0.0 and 1.0.
* @param dev DShot output device
* @param ltd left-top motor thrust
* @param rtd right-top motor thrust
* @param lbd left-bottom motor thrust
* @param rbd right-bottom motor thrust
* @return always 0
*/
int setthrust(struct cdevice *dev,
	double ltd, double rtd, double lbd, double rbd);

#endif
